### 화면 크기 800 * 600
### 거북이 객체 3개 생성  
### t1 = turtle,   red,     초기좌표 -100, -100, shapesize = 2
### t2 = square, blue,   초기좌표   0,      0,     shapesize = 2
### t3 = circle,   green, 초기좌표  100,   100,  shapesize = 2
### 거북이들이 서로 충돌하면 종료(break) 아니면 무한 반복
###       거북이 각각에 randrange()로 각도와 거리 생성 후 실행
###       거북이 각각의 x, y 좌표 추출,  xcor(), ycor()
###       거북이 좌표를 이용해 거리 계산 후 충돌 확인, (거리 <= 50)
###           충돌이면 shapesize = 4로 하고 break
###       거북이가 화면 밖인지 확인 후 밖이면 초기 좌표로 이동        

import turtle as t
import random as ra

t1 = t2 = t3 = None
tx1 = ty1 = tx2 = ty2 = tx3 = ty3 = 0

swidth = 800
sheight = 600

t.done()


### 소수 판별, 소수가 아니면 가장 작은 제수 출력,    111119,   6999899,   4581300041



### 개선된 소수 판별, 소수가 아니면 가장 작은 제수 출력



### 더 개선된 소수 판별, 소수가 아니면 가장 작은 제수 출력



### 더더 개선된 소수 판별, 소수가 아니면 가장 작은 제수 출력



### 10진수를 입력 받아 정수의 역순으로 된 정수 출력



### 16진수를 입력 받아 각 자리수 합계 출력



### 콤마로 분리된 정수합 출력












